[
    {"id": "C001", "name": "Classic Chocolate Cake", "quantity": 15, "price": 35, "type": "cake", "description": "A medium-sized double-layer chocolate cake with rich chocolate frosting, perfect for birthdays and celebrations. This affordable cake is a crowd-pleaser with its moist texture and deep cocoa flavor."},
    {"id": "C002", "name": "Vanilla Bean Delight", "quantity": 12, "price": 32, "type": "cake", "description": "A medium-sized vanilla cake with flecks of real vanilla bean throughout, topped with creamy vanilla buttercream. This reasonably priced cake offers a classic, elegant option for any occasion."},
    {"id": "C003", "name": "Red Velvet Elegance", "quantity": 10, "price": 38, "type": "cake", "description": "A large red velvet cake with cream cheese frosting, suitable for anniversaries and romantic celebrations. This premium cake combines a subtle cocoa flavor with a stunning red color."},
    {"id": "C004", "name": "Luscious Lemon Layer Cake", "quantity": 8, "price": 36, "type": "cake", "description": "A medium-sized lemon cake with lemon curd filling and zesty lemon buttercream, great for spring events and bridal showers. This reasonably priced cake offers a perfect balance of sweet and tangy flavors."},
    {"id": "C005", "name": "Carrot Cake with Cream Cheese", "quantity": 10, "price": 40, "type": "cake", "description": "A large spiced carrot cake with walnuts, raisins, and creamy cream cheese frosting, perfect for family gatherings. This moderately priced cake is packed with flavor and nostalgic charm."},
    {"id": "C006", "name": "Tiramisu Torte", "quantity": 6, "price": 45, "type": "specialty", "description": "A medium-sized Italian tiramisu cake with espresso-soaked layers, mascarpone filling, and cocoa dusting, suitable for dinner parties. This high-end cake brings sophisticated coffee flavors to any celebration."},
    {"id": "C007", "name": "Confetti Birthday Cake", "quantity": 14, "price": 34, "type": "cake", "description": "A large, colorful vanilla cake with rainbow sprinkles throughout and vanilla buttercream, ideal for children's birthdays. This mid-range cake brings joy and celebration with every colorful slice."},
    {"id": "C008", "name": "Simple Strawberry Shortcake", "quantity": 18, "price": 30, "type": "cake", "description": "A medium-sized light vanilla sponge cake layered with fresh strawberries and whipped cream, perfect for summer gatherings. This budget-friendly cake is a light and refreshing classic."},
    {"id": "C009", "name": "Ultimate Chocolate Truffle Cake", "quantity": 10, "price": 48, "type": "specialty", "description": "A large decadent chocolate cake with chocolate ganache, chocolate shavings, and edible gold dust, suitable for luxury events and milestone celebrations. This premium cake is the ultimate chocolate lover's dream."},
    {"id": "C010", "name": "Seasonal Fruit Cake", "quantity": 12, "price": 36, "type": "cake", "description": "A medium-sized vanilla cake topped with seasonal fresh fruits and a light glaze, perfect for any general occasion. This reasonably priced cake showcases the best fruits of the season."},
    {"id": "C011", "name": "Classic Cupcake Box - Vanilla", "quantity": 25, "price": 24, "type": "cupcakes", "description": "A box of 12 vanilla cupcakes with vanilla buttercream and sprinkles, suitable for parties and office celebrations. These affordable cupcakes are a convenient crowd-pleaser."},
    {"id": "C012", "name": "Classic Cupcake Box - Chocolate", "quantity": 20, "price": 24, "type": "cupcakes", "description": "A box of 12 chocolate cupcakes with chocolate frosting, perfect for parties and small gatherings. These reasonably priced cupcakes satisfy any chocolate craving."},
    {"id": "C013", "name": "Assorted Cupcake Collection", "quantity": 15, "price": 28, "type": "cupcakes", "description": "A box of 12 cupcakes with an assortment of flavors including vanilla, chocolate, red velvet, and lemon, ideal for offering variety at events. This mid-range collection pleases diverse palates."},
    {"id": "C014", "name": "Rustic Apple Cinnamon Cake", "quantity": 8, "price": 38, "type": "cake", "description": "A large spiced apple cake with cinnamon streusel topping and caramel drizzle, suitable for fall gatherings and Thanksgiving. This premium cake brings a touch of autumn comfort to any table."},
    {"id": "C015", "name": "Tropical Coconut Pineapple Cake", "quantity": 6, "price": 42, "type": "specialty", "description": "A large, exotic cake with coconut layers, pineapple filling, and coconut cream frosting, perfect for summer parties and tropical-themed events. This high-end cake is a vacation for your taste buds."},
    {"id": "C016", "name": "Mini Cheesecake Sampler", "quantity": 10, "price": 32, "type": "specialty", "description": "A set of 12 bite-sized cheesecakes in various flavors including classic, strawberry, chocolate, and caramel, ideal for dessert platters. This moderately priced sampler offers elegant variety."},
    {"id": "C017", "name": "Gluten-Free Chocolate Cake", "quantity": 12, "price": 40, "type": "dietary", "description": "A small, rich chocolate cake made with gluten-free flour and topped with ganache, perfect for those with gluten sensitivities. This reasonably priced specialty cake ensures everyone can enjoy dessert."},
    {"id": "C018", "name": "Vegan Vanilla Celebration Cake", "quantity": 7, "price": 42, "type": "dietary", "description": "A medium-sized vanilla cake made without animal products, topped with vegan buttercream, suitable for those following a vegan lifestyle. This premium specialty cake is as delicious as it is inclusive."},
    {"id": "C019", "name": "Pumpkin Spice Cake", "quantity": 10, "price": 36, "type": "cake", "description": "A medium-sized spiced pumpkin cake with cream cheese frosting, perfect for fall birthdays and Thanksgiving. This reasonably priced seasonal cake captures the essence of autumn."},
    {"id": "C020", "name": "Winter Peppermint Chocolate Cake", "quantity": 8, "price": 40, "type": "cake", "description": "A large chocolate cake with peppermint buttercream and crushed candy cane decoration, ideal for Christmas and winter celebrations. This premium seasonal cake brings festive flavors to holiday gatherings."},
    {"id": "C021", "name": "Spring Lemon Blueberry Cake", "quantity": 12, "price": 38, "type": "cake", "description": "A medium-sized lemon cake with blueberry compote filling and lemon cream cheese frosting, suitable for Easter and spring events. This affordable cake is a fresh burst of springtime flavor."},
    {"id": "C022", "name": "Summer Berry Chantilly Cake", "quantity": 9, "price": 44, "type": "cake", "description": "A large vanilla cake layered with fresh summer berries and light Chantilly cream, perfect for garden parties and summer weddings. This moderately priced cake captures the essence of summer freshness."},
    {"id": "C023", "name": "Mini Bundt Cake Box", "quantity": 15, "price": 26, "type": "specialty", "description": "A set of 6 mini bundt cakes in assorted flavors including lemon, chocolate, and cinnamon, ideal for gifts or small gatherings. This affordable collection offers charming individual-sized treats."},
    {"id": "C024", "name": "Lavender Honey Cake", "quantity": 11, "price": 38, "type": "specialty", "description": "A medium-sized delicate cake infused with lavender and honey, topped with honey buttercream, perfect for tea parties and Mother's Day. This reasonably priced specialty cake offers a unique floral experience."},
    {"id": "C025", "name": "Citrus Explosion Cake", "quantity": 7, "price": 40, "type": "cake", "description": "A medium-sized cake featuring layers of lemon, orange, and lime flavors with citrus buttercream, ideal for summer birthdays. This moderately priced cake adds a zesty brightness to any celebration."},
    {"id": "C026", "name": "Dark Chocolate Espresso Cake", "quantity": 6, "price": 46, "type": "specialty", "description": "A large, intense chocolate cake infused with espresso, covered in mocha ganache, perfect for sophisticated adult celebrations. This premium cake offers a bold and complex flavor profile."},
    {"id": "C027", "name": "Cherry Blossom Almond Cake", "quantity": 10, "price": 42, "type": "specialty", "description": "A medium-sized almond cake with cherry filling and delicate pink cherry blossom decoration, ideal for bridal showers or spring celebrations. This moderately priced cake brings an elegant and romantic touch."},
    {"id": "C028", "name": "Ocean Blue Ombre Cake", "quantity": 13, "price": 40, "type": "cake", "description": "A medium-sized vanilla cake with blue ombre frosting reminiscent of ocean waves, perfect for beach-themed parties or baby showers. This reasonably priced cake offers a stunning visual presentation."},
    {"id": "C029", "name": "Rustic Naked Cake", "quantity": 9, "price": 36, "type": "cake", "description": "A medium-sized minimally frosted cake with visible layers and fresh berries, ideal for rustic weddings and farm-to-table events. This affordable cake brings a touch of understated elegance to any occasion."},
    {"id": "C030", "name": "Elegant Black and White Cake", "quantity": 7, "price": 48, "type": "specialty", "description": "A large, sophisticated cake featuring alternating layers of white and dark chocolate with matching two-tone frosting, perfect for formal events and milestone birthdays. This premium cake offers a timeless and luxurious aesthetic."},
    {"id": "C031", "name": "Sunshine Lemon Cupcakes", "quantity": 14, "price": 26, "type": "cupcakes", "description": "A box of 12 cheerful lemon cupcakes with lemon buttercream and yellow sugar crystals, great for spring events or brightening someone's day. These budget-friendly cupcakes are sure to bring smiles."},
    {"id": "C032", "name": "Royal Purple Velvet Cake", "quantity": 8, "price": 44, "type": "specialty", "description": "A large cake featuring rich purple velvet layers with cream cheese frosting and silver accents, suitable for luxurious celebrations and milestone birthdays. This premium cake exudes elegance and sophistication."},
    {"id": "C033", "name": "Fairy Tale Castle Cake", "quantity": 5, "price": 65, "type": "specialty", "description": "A small but elaborate castle-shaped cake with turrets and edible glitter, perfect for children's fantasy-themed birthdays. This high-end specialty cake creates magical memories for special celebrations."},
    {"id": "C034", "name": "Holiday Yule Log Cake", "quantity": 12, "price": 40, "type": "seasonal", "description": "A medium-sized chocolate roll cake decorated to resemble a traditional Yule log with meringue mushrooms, ideal for Christmas celebrations. This moderately priced seasonal cake brings festive tradition to holiday gatherings."},
    {"id": "C035", "name": "Rainbow Layer Cake", "quantity": 6, "price": 50, "type": "specialty", "description": "A large, show-stopping cake with six rainbow-colored layers and vanilla buttercream, perfect for Pride celebrations and colorful themed parties. This premium cake creates gasps of delight when cut open."},
    {"id": "C036", "name": "Pastel Watercolor Cake", "quantity": 10, "price": 40, "type": "cake", "description": "A medium-sized vanilla cake with buttercream frosted in soft watercolor-style pastels, ideal for baby showers and spring celebrations. This reasonably priced cake offers a gentle and artistic presentation."},
    {"id": "C037", "name": "Cookies and Cream Cake", "quantity": 15, "price": 34, "type": "cake", "description": "A medium-sized chocolate cake with cookies and cream filling and frosting, topped with chocolate sandwich cookies, perfect for casual celebrations. This affordable cake combines two classic dessert favorites."},
    {"id": "C038", "name": "Silver Anniversary Cake", "quantity": 7, "price": 55, "type": "specialty", "description": "A medium-sized elegant white cake with silver leaf accents and white chocolate ganache, ideal for 25th wedding anniversaries. This premium cake offers a sophisticated and commemorative centerpiece."},
    {"id": "C039", "name": "Tropical Mango Passion Fruit Cake", "quantity": 8, "price": 46, "type": "specialty", "description": "A large, vibrant cake featuring mango and passion fruit layers with coconut cream frosting, perfect for summer parties and tropical-themed events. This high-end cake brings exotic flavors to any celebration."},
    {"id": "C040", "name": "Victorian Sponge Cake", "quantity": 11, "price": 38, "type": "cake", "description": "A large, classic sponge cake filled with strawberry jam and vanilla buttercream, dusted with powdered sugar, ideal for afternoon teas and garden parties. This moderately priced cake offers timeless British elegance."},
    {"id": "C041", "name": "Salted Caramel Drip Cake", "quantity": 9, "price": 42, "type": "cake", "description": "A medium-sized chocolate cake with salted caramel filling, caramel buttercream, and a dramatic caramel drip, perfect for trendy celebrations. This reasonably priced cake offers an indulgent sweet-salty experience."},
    {"id": "C042", "name": "Fresh Strawberry Shortcake Cupcakes", "quantity": 13, "price": 28, "type": "cupcakes", "description": "A box of 12 vanilla cupcakes topped with whipped cream and fresh strawberries, ideal for summer gatherings. These reasonably priced cupcakes offer a light and refreshing individual dessert option."},
    {"id": "C043", "name": "Maple Pecan Cake", "quantity": 10, "price": 40, "type": "cake", "description": "A medium-sized spice cake with maple syrup, chopped pecans, and maple buttercream frosting, perfect for fall gatherings and Thanksgiving. This moderately priced cake brings warm autumnal flavors to any table."}
]
